Tekla.Structures.Drawing.PointList
The PointList class defines a type safe point list.
The following example adds a few points to the point list and inserts a new polygon:
using Tekla.Structures.Drawing;
using Tekla.Structures.Geometry3d;
public class Example
{
public void Example1()
{
Drawing MyDrawing = new GADrawing();
View MyView = new View(MyDrawing.GetSheet(), new CoordinateSystem(), new CoordinateSystem(),
new AABB(new Point(), new Point(30000, 30000, 10000)));
PointList MyPointList = new PointList();
MyPointList.Add(new Point(0.0, 0.0, 0.0));
MyPointList.Add(new Point(100.0, 0.0, 0.0));
MyPointList.Add(new Point(100.0, 500.0, 0.0));
MyPointList.Add(new Point(0.0, 500.0, 0.0));
Polygon MyPolygon = new Polygon(MyView, MyPointList);
MyPolygon.Insert();
}
}

Tekla.Structures.Drawing.PointList.Item(System.Int32)
Gets or sets the point at the specified index.
index: The zero-based index of the element to get or set.

Tekla.Structures.Drawing.PointList.Add(Tekla.Structures.Geometry3d.Point)
Adds a new point to the end of the point list.
value: The point to be added to the list.
Returns: The index where the point was added.

Tekla.Structures.Drawing.PointList.AddRange(Tekla.Structures.Drawing.PointList)
Appends all points from another point list to the end of this point list.
value: The points to be added to the list.

Tekla.Structures.Drawing.PointList.Contains(Tekla.Structures.Geometry3d.Point)
Checks if the given point is in the list.
value: The point to be checked.
Returns: True if the point is in the list, otherwise false.

Tekla.Structures.Drawing.PointList.IndexOf(Tekla.Structures.Geometry3d.Point)
Gets the index of the specified point.
value: The point to locate in the list.
Returns: The index of the point if found in the list, otherwise -1.

Tekla.Structures.Drawing.PointList.IndexOf(Tekla.Structures.Geometry3d.Point,System.Int32)
Gets the index of the specified point between the index to start the search
from and the end of the list.
value: The point to locate in the list.
startIndex: The index to start the search from.
Returns: The index of the point if found in the list, otherwise -1.

Tekla.Structures.Drawing.PointList.IndexOf(Tekla.Structures.Geometry3d.Point,System.Int32,System.Int32)
Gets the index of the specified point between the index to start the search from and startIndex + count.
value: The point to locate in the list.
startIndex: The index to start the search from.
count: The number of items searched.
Returns: The index of the point if found in the list, otherwise -1.

Tekla.Structures.Drawing.PointList.Insert(System.Int32,Tekla.Structures.Geometry3d.Point)
Inserts the point to the specified index.
index: The index where the point is inserted.
value: The point to be inserted.

Tekla.Structures.Drawing.PointList.GetRange(System.Int32,System.Int32)
Gets a part of the point list.
index: The start index of the new list.
count: The number of items in the new list.
Returns: The new point list.

Tekla.Structures.Drawing.PointList.LastIndexOf(Tekla.Structures.Geometry3d.Point)
Searches for the last occurence of the point in the list.
value: The point to locate.
Returns: The last index of the point if found, otherwise -1.

Tekla.Structures.Drawing.PointList.LastIndexOf(Tekla.Structures.Geometry3d.Point,System.Int32)
Searches for the last occurence of the point in the list.
value: The point to locate.
startIndex: The index to start the search from.
Returns: The last index of the point if found, otherwise -1.

Tekla.Structures.Drawing.PointList.LastIndexOf(Tekla.Structures.Geometry3d.Point,System.Int32,System.Int32)
Searches for the last occurence of the point in the list.
value: The point to locate.
startIndex: The index to start the search from.
count: The number of items searched.
Returns: The last index of the point if found, otherwise -1.

Tekla.Structures.Drawing.PointList.Remove(Tekla.Structures.Geometry3d.Point)
Removes the first occurence of the point from the list.
value: The point to be removed.

Tekla.Structures.Drawing.PointList.RemoveRange(System.Int32,System.Int32)
Removes a range of items starting from the given index.
index: The start index.
count: The number of items to be removed.

Tekla.Structures.Drawing.PointList.ToArray
Copies the points to a point array.
Returns: The array of points.

Tekla.Structures.Drawing.PointList.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.